#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.commons.module.apim.azurerm_api_management.this has been deleted
  - resource "azurerm_api_management" "this" {
      - gateway_url                   = "https://ts-p-apim-01.azure-api.net" -> null
      - id                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.ApiManagement/service/ts-p-apim-01" -> null
      - name                          = "ts-p-apim-01" -> null
      - private_ip_addresses          = [] -> null
      - public_ip_addresses           = [
          - "172.213.194.3",
        ] -> null
        tags                          = {}
        # (17 unchanged attributes hidden)

      - identity {
          - principal_id = "c3f47011-e2b8-4c4c-ae35-c37db0997473" -> null
            # (3 unchanged attributes hidden)
        }

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.commons.azurerm_dns_a_record.api_trial_pagopa_it will be updated in-place
  ~ resource "azurerm_dns_a_record" "api_trial_pagopa_it" {
        id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/dnsZones/trial.pagopa.it/A/api"
        name                = "api"
      ~ records             = [
          - "172.213.192.244",
        ] -> (known after apply)
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (4 unchanged attributes hidden)
    }

  # module.commons.azurerm_private_dns_zone.privatelink_api_net will be destroyed
  # (because azurerm_private_dns_zone.privatelink_api_net is not in configuration)
  - resource "azurerm_private_dns_zone" "privatelink_api_net" {
      - id                                                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azure-api.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.azure-api.net" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "ts-p-itn-net-rg-01" -> null
      - tags                                                  = {} -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.azure-api.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.commons.azurerm_private_dns_zone_virtual_network_link.apim_link will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.apim_link is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "apim_link" {
      - id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azure-api.net/virtualNetworkLinks/ts-p-itn-vnet-01" -> null
      - name                  = "ts-p-itn-vnet-01" -> null
      - private_dns_zone_name = "privatelink.azure-api.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "ts-p-itn-net-rg-01" -> null
      - tags                  = {} -> null
      - virtual_network_id    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01" -> null
    }

  # module.commons.azurerm_public_ip.appgateway_public_ip must be replaced
-/+ resource "azurerm_public_ip" "appgateway_public_ip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-rg-external-01/providers/Microsoft.Network/publicIPAddresses/ts-p-itn-appgateway-pip-01" -> (known after apply)
      ~ ip_address              = "172.213.192.244" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "ts-p-itn-appgateway-pip-01"
      ~ resource_group_name     = "ts-p-itn-rg-external-01" -> "ts-p-itn-routing-rg-01" # forces replacement
        tags                    = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (8 unchanged attributes hidden)
    }

  # module.commons.azurerm_resource_group.rg_external will be destroyed
  # (because azurerm_resource_group.rg_external is not in configuration)
  - resource "azurerm_resource_group" "rg_external" {
      - id       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-rg-external-01" -> null
      - location = "italynorth" -> null
      - name     = "ts-p-itn-rg-external-01" -> null
      - tags     = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Owner"          = "TRIAL"
          - "Source"         = "https://github.com/pagopa/trial-system"
        } -> null
    }

  # module.commons.azurerm_subnet_network_security_group_association.snet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.Network/networkSecurityGroups/ts-p-itn-apim-nsg"
      + subnet_id                 = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-apim-snet-01"
    }

  # module.commons.module.apim.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + name                          = "ts-p-itn-apim-01"
      + notification_sender_email     = "ts-apim@pagopa.it"
      + policy                        = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "ts-apim@pagopa.it"
      + publisher_name                = "TRIAL"
      + resource_group_name           = "ts-p-itn-routing-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + virtual_network_type          = "Internal"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + virtual_network_configuration {
          + subnet_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-apim-snet-01"
        }
    }

  # module.commons.module.apim.azurerm_api_management_diagnostic.this[0] will be created
  + resource "azurerm_api_management_diagnostic" "this" {
      + always_log_errors         = true
      + api_management_logger_id  = (known after apply)
      + api_management_name       = "ts-p-itn-apim-01"
      + http_correlation_protocol = "W3C"
      + id                        = (known after apply)
      + identifier                = "applicationinsights"
      + log_client_ip             = true
      + operation_name_format     = "Name"
      + resource_group_name       = "ts-p-itn-routing-rg-01"
      + sampling_percentage       = 5
      + verbosity                 = "error"
    }

  # module.commons.module.apim.azurerm_api_management_logger.this[0] will be created
  + resource "azurerm_api_management_logger" "this" {
      + api_management_name = "ts-p-itn-apim-01"
      + buffered            = true
      + id                  = (known after apply)
      + name                = "ts-p-itn-apim-01-logger"
      + resource_group_name = "ts-p-itn-routing-rg-01"

      + application_insights {
          + instrumentation_key = (sensitive value)
        }
    }

  # module.commons.module.cosmosdb_account.azurerm_cosmosdb_account.this will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01"
      - ip_range_filter                          = "95.250.166.183,104.42.195.92,40.76.54.131,52.176.6.30,52.169.50.45,52.187.184.26,13.88.56.148,40.91.218.243,13.91.105.215,4.210.172.107" -> null
        name                                     = "ts-p-itn-trial-account-01"
      ~ public_network_access_enabled            = true -> false
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (32 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01-staging" -> "subscription-async-fn-01"
            # (33 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01"
        name                                           = "ts-p-itn-subscription-async-fn-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=048770ed-3c3c-4b85-a24c-3f2e17228823;IngestionEndpoint=https://italynorth-0.in.applicationinsights.azure.com/;LiveEndpoint=https://italynorth.livediagnostics.monitor.azure.com/;ApplicationId=010aac71-4c33-4b73-ad13-fb71d9d608fb"
            "hidden-link: /app-insights-instrumentation-key" = "048770ed-3c3c-4b85-a24c-3f2e17228823"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/microsoft.insights/components/ts-p-itn-trial-ai-01"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01" -> "subscription-async-fn-01-staging"
            # (33 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 2 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 2 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 7 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.commons.module.apim.azurerm_monitor_diagnostic_setting.apim,
  on .terraform/modules/commons.apim/api_management/main.tf line 355, in resource "azurerm_monitor_diagnostic_setting" "apim":
 355: resource "azurerm_monitor_diagnostic_setting" "apim" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 11 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/commons.cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
